Table of Contents
 Class RebarGeneral
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Represents a single main rebar in 3D space. Holds data from generated rebar or rebar imported from Tekla. the rebarShape is in global coordinates and it is not possible to prject it along Member1D, Polyline, ... (referenceLine)
[OpenModelClass("CI.StructModel.Structure.RebarGeneral,CI.StructuralElements", "CI.StructModel.Structure.IRebarGeneral,CI.BasicTypes")]
public class RebarGeneral : RebarBase
Inheritance
object
OpenObject
OpenElementId
RebarBase
RebarGeneral
Inherited Members
 RebarBase.Material
 RebarBase.Diameter
 RebarBase.RebarShape
 RebarBase.RebarParentElement
 RebarBase.RebarAllocationElement
 RebarBase.GroupId
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 RebarGeneral()
create a new instance.
public RebarGeneral()
Properties
 PlaneNormal
Normal vector of the plane where the rebar lie. Used to deterine if this rebar is stirrup.
public Vector3D PlaneNormal { get; set; }
Property Value
Vector3D
 RebarType
Rebar type
public RebarGeneralType RebarType { get; set; }
Property Value
RebarGeneralType
 Edit this page